{
    "title": "Mihaela Raducu - Frontend Developer | CV",
    "meniu.home": "Home",
    "meniu.about": "About",
    "meniu.experience": "Experience",
    "meniu.portfolio": "Portfolio",
    "meniu.github": "My GitHub",
    "meniu.contact": "Contact",
    "banner.hello": "Hello!",
    "banner.mihaela": "I am Mihaela",
    "banner.me": "More About Me",
    "typed": "Frontend, Developer",
    "banner.more": "More About Me",
    "ab.name": "Name: ",
    "ab.prof": "Profile: ",
    "ab.phone": "Phone: ",
    "ab.skill": "Skills",
    "ab.abt": "About me",
    "ab.para1": "With experience in the tech field, particularly in Smart City projects, I have contributed to the development and implementation of innovative solutions with a real impact.",
    "ab.para2": "Currently, I am expanding my skills in Web Development through an intensive Front-End JavaScript course, focused on HTML, CSS, JavaScript, Responsive Design, and modern frameworks. My goal is to build a solid portfolio and become part of a collaborative development team.",
    "ab.para3": "Bringing a structured approach and strong attention to detail from previous roles, I combine these with the creativity and adaptability of web development. In the long term, I aim to grow into a skilled Full-Stack JavaScript Developer and contribute to meaningful, forward-thinking projects.",
    "exp.work": "Work Experience",
    "exp.job3": "Smart City Project Manager",
    "exp.data3": "October 2021 - November 2024",
    "exp.work3": "Managed projects focused on integrating innovative technological solutions into urban planning and sustainable development strategies. The role involved overseeing complex projects, collaborating closely with various stakeholders, and delivering customized Smart City solutions to modernize and optimize urban environments.",
    "exp.job2": "Project Development Consultant",
    "exp.data2": "September 2020 - September 2021",
    "exp.work2": "Oversaw the development and implementation of European-funded projects, with a strong focus on urban development and sustainability. This role covered the entire funding process, from identifying opportunities and preparing applications to monitoring project execution, ensuring compliance with European standards, and tailoring solutions to client needs.",
    "exp.job1": "European Funding Advisor",
    "exp.data1": "September 2018 - August 2020",
    "exp.work1": "Developed and implemented European-funded projects, focusing on sustainable development and effective solutions for urban development. This role involved managing the entire process from strategic planning to execution, ensuring compliance with European standards and meeting client-specific requirements.",
    "exp.education": "Education",
    "exp.it": "IT Courses",
    "exp.data4": "November 2024 - Present",
    "exp.frontend": "Frontend JavaScript Development",
    "exp.master": "Master Degree",
    "exp.data5": "October 2016 - July 2018",
    "exp.university": "National University of Political Studies and Public Administration",
    "exp.univ": "Public Affairs Management",
    "exp.bachelor": "Bachelor Degree",
    "exp.data6": "October 2013 - July 2016",
    "exp.university2": "National University of Political Studies and Public Administration",
    "exp.univ2": "Administrative Sciences, European Administration",
    "exp.certification": "Certifications",
    "exp.management": "Project Management Certificate",
    "exp.data7": "July 2021 - September 2021",
    "exp.manager": "Project Manager",
    "exp.smart": "Smart City Strategies Certificate",
    "exp.data8": "April 2021 - June 2021",
    "exp.univ3": "National University of Political Studies and Public Administration",
    "exp.public": "Public Innovation and Smart City Strategies",
    "port.portofolio": "Portfolio",
    "port.projects": "The latest projects completed",
    "proj1.title1": "Frontend Path",
    "proj1.para1": "This roadmap provides a clear overview of the essential steps to becoming a Frontend Developer. It is a structured guide for those who want to pursue a career in web development but are unsure where to start or how to organize their learning path.",
    "port.para2": "Key steps covered:",
    "proj1.para3": "Learn the fundamentals: HTML, CSS, and JavaScript",
    "proj1.para4": "Explore modern frameworks and libraries like React, Vue.js, or Angular",
    "proj1.para5": "Practice consistently through personal projects and coding challenges",
    "proj1.para6": "Stay up to date with industry trends and continue learning",
    "proj1.para7": "Build a portfolio that showcases your skills",
    "proj1.para8": "Connect with the developer and tech community",
    "proj1.para9": "For a more detailed overview, including the full design and useful resources, feel free to check out the LinkedIn post: <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:7303037542184939522/\" target=\"_blank\" style=\"text-decoration: underline; font-weight: bold;\">View the post on LinkedIn</a>",
    "proj2.title": "My CV",
    "proj2.para1": "My online CV, built as a single-page application to present my projects, skills, and frontend development journey.",
    "proj2.para2": "Developed using HTML, CSS, and JavaScript, with a focus on responsive structure, clarity, and user accessibility.",
    "proj2.para3": "The project also integrates Bootstrap for layout flexibility and Webpack for asset management and build optimization.",
    "proj3.title": "One-Pager",
    "proj3.para1": "This is a one-page website built with HTML, CSS, and Bootstrap, designed to showcase a responsive layout. The project includes a custom logo, a full-screen video banner, animated elements using AOS, and a dark mode toggle.",
    "proj3.para2": "Key features implemented:",
    "proj3.para3": "Responsive layout with Bootstrap grid system",
    "proj3.para4": "Custom logo and favicon integration",
    "proj3.para5": "Full-width background video in the hero section",
    "proj3.para6": "Scroll-based animations with AOS",
    "proj3.para7": "Section-based smooth navigation and sticky header",
    "proj3.para8": "Dark mode toggle functionality",
    "proj3.para9": "Contact form and embedded Google Maps",
    "proj3.para10": "Modular structure: About, Services, Portfolio, Testimonials, Contact",
    "proj3.para11": "The structure is complete, and visual content (text/images) is still being refined. This is my second full-layout project, focusing on complexity, user experience, and design consistency.",
    "proj3.para12": "<a href=\"https://mihaelaraducu.github.io/proiectcss/\" target=\"_blank\" style=\"text-decoration: underline; font-weight: bold;\">View the live project</a>",
    "proj4.title": "Design Showcase",
    "proj4.para1": "This creative mockup was designed to illustrate modern, responsive layouts across various devices. Although not a functional website, it highlights essential design principles such as balance, whitespace, visual hierarchy, and typography.",
    "proj5.title": "Frontend Journey",
    "proj5.para1": "This visual piece represents a key moment in my early development as a frontend developer. After building my first responsive website using HTML and CSS, I began focusing more deeply on layout structure, design systems, and responsive behavior across devices.",
    "proj5.para2": "Although not a functional project, this mockup captures the transition from purely technical implementation to more thoughtful and intentional visual design. It reflects an important phase where I started to connect technical execution with user experience and design clarity.",
    "proj5.para3": "This stage marked the beginning of a more strategic approach to how I plan, structure, and present my work.",
    "proj6.title": "Responsive Website",
    "proj6.para1": "This project represents my first step into frontend development, focusing on building a fully responsive static website using only HTML and CSS. It allowed me to apply core principles of web layout, structure, and responsive design.",
    "proj6.para2": "Key focus areas:",
    "proj6.para3": "Semantic HTML structure for clarity and accessibility",
    "proj6.para4": "CSS styling with a focus on visual hierarchy and layout",
    "proj6.para5": "Responsive design using media queries and flexible units",
    "proj6.para6": "Layout optimized for multiple device sizes",
    "proj6.para7": "This project marked the beginning of my journey into frontend development. It helped me understand how structure and style work together to create accessible and user-friendly experiences across devices.",
    "proj6.para8": "<a href=\"https://mihaelaraducu.github.io/html-css-project/\" target=\"_blank\" style=\"text-decoration: underline; font-weight: bold;\">View the live project</a>",
    "git.noscript": "JavaScript is disabled in your browser. Please enable it to view the content of this page.",
    "git.repo": "My GitHub Repo",
    "git.hub": "The latest GitHub Repo",
    "ct.message": "Send Me a Message",
    "ct.place.name": "Name",
    "ct.place.email": "Your Email",
    "ct.place.subject": "Subject",
    "ct.place.message": "Message",
    "ct.title": "Would you like to collaborate?",
    "ct.inf": "Whether you need help with a frontend project, are building a web development team, or want to implement modern tech solutions,<br>I am open to collaboration opportunities!<br>Feel free to fill out the form or send me an email.<br>I look forward to discussing potential collaborations and contributing together to impactful projects.",
    "ct.send": "Send Message",
    "ct.valid1.name": "The name field is valid!",
    "ct.invalid1.name": "Please complete the name field correctly!",
    "ct.valid2.email": "The email field is valid!",
    "ct.invalid2.email": "Please complete the email field correctly!",
    "ct.valid3.subject": "The subject field is valid!",
    "ct.invalid3.subject": "Please complete the subject field correctly!",
    "ct.valid4.message": "The message field is valid!",
    "ct.invalid4.message": "Please complete the message field correctly!",
    "ft.copy": "<span>&copy;</span> Copyright <strong>Mihaela Raducu</strong>. All Rights Reserved",
    "ft.credits": "Designed by <a href=\"#\">Mihaela Raducu</a>"
}