{
    "title": "WebSite Building Bootstrap + Webpack",
    "meniu.home": "Home",
    "meniu.about": "About",
    "meniu.experience": "Experience",
    "meniu.portfolio": "Portfolio",
    "meniu.github": "My GitHub",
    "meniu.contact": "Contact",
    "banner.hello": "Hello!",
    "banner.mihaela": "I am Mihaela",
    "banner.me": "More About Me",

    "typed": "Frontend, Developer",
    "ab.name": "Name: ",
    "ab.prof": "Profile: ",
    "ab.phone": "Phone: ",
    "ab.skill": "Skills",
    "ab.abt":"About me",
    "ab.para1":"With experience in the tech field, particularly in Smart City projects, I have contributed to the development and implementation of innovative solutions with a real impact.",
    "ab.para2":"Currently, I am expanding my skills in Web Development through an intensive Front-End JavaScript course, focused on HTML, CSS, JavaScript, Responsive Design, and modern frameworks. My goal is to build a solid portfolio and become part of a collaborative development team.",
    "ab.para3":"Bringing a structured approach and strong attention to detail from previous roles, I combine these with the creativity and adaptability of web development. In the long term, I aim to grow into a skilled Full-Stack JavaScript Developer and contribute to meaningful, forward-thinking projects.",
    "exp.work": "Work Experience",
    "exp.job3": "Smart City Project Manager",
    "exp.data3": "October 2021 - November 2024",
    "exp.work3": "Managed projects focused on integrating innovative technological solutions into urban planning and sustainable development strategies. The role involved overseeing complex projects, collaborating closely with various stakeholders, and delivering customized Smart City solutions to modernize and optimize urban environments.",
    "exp.job2": "Project Development Consultant",
    "exp.data2": "September 2020 - September 2021",
    "exp.work2": "Oversaw the development and implementation of European-funded projects, with a strong focus on urban development and sustainability. This role covered the entire funding process, from identifying opportunities and preparing applications to monitoring project execution, ensuring compliance with European standards, and tailoring solutions to client needs.",
    "exp.job1": "European Funding Advisor",
    "exp.data1": "September 2018 - August 2020",
    "exp.work1": "Developed and implemented European-funded projects, focusing on sustainable development and effective solutions for urban development. This role involved managing the entire process from strategic planning to execution, ensuring compliance with European standards and meeting client-specific requirements.",
    "exp.education": "Education",
    "exp.it": "IT Courses",
    "exp.data4": "November 2024 - Present",
    "exp.frontend": "Frontend JavaScript Development",
    "exp.master": "Master Degree",
    "exp.data5": "October 2016 - July 2018",
    "exp.university": "National University of Political Studies and Public Administration",
    "exp.univ": "Public Affairs Management",
    "exp.bachelor": "Bachelor Degree",
    "exp.data6": "October 2013 - July 2016",
    "exp.university2": "National University of Political Studies and Public Administration",
    "exp.univ2": "Administrative Sciences, European Administration",
    "exp.certification": "Certifications",
    "exp.management": "Project Management Certificate",
    "exp.data7": "July 2021 - September 2021",
    "exp.manager": "Project Manager",
    "exp.smart": "Smart City Strategies Certificate",
    "exp.data8": "April 2021 - June 2021",
    "exp.univ3": "National University of Political Studies and Public Administration",
    "exp.public": "Public Innovation and Smart City Strategies",
    "port.portofolio": "Portfolio",
    "port.projects": "The latest projects completed",
    "proj1.title1": "Frontend Path",
    "proj1.para1": "This roadmap provides a clear overview of the essential steps to becoming a Frontend Developer. It is a structured guide for those who want to pursue a career in web development but are unsure where to start or how to organize their learning path.",
    "port.para2": "Key steps covered:",
    "proj1.para3": "Learn the fundamentals: HTML, CSS, and JavaScript",
    "proj1.para4": "Explore modern frameworks and libraries like React, Vue.js, or Angular",
    "proj1.para5": "Practice consistently through personal projects and coding challenges",
    "proj1.para6": "Stay up to date with industry trends and continue learning",
    "proj1.para7": "Build a portfolio that showcases your skills",
    "proj1.para8": "Connect with the developer and tech community",
    "proj1.para9": "For a more detailed overview, including the full design and useful resources, feel free to check out the LinkedIn post:",
    "proj1.para10": "View the post on LinkedIn",


    "git.repo": "My GitHub Repo",
    "git.hub": "The latest GitHub Repo",
    "ct.message": "Send Me a Message",
    "ct.place.name": "Name",
    "ct.place.email": "Your Email",
    "ct.place.subject": "Subject",
    "ct.place.message": "Message",
    "ct.title": "Would you like to collaborate?",
    "ct.inf":  "Whether you need assistance with a frontend project, are looking for a dedicated collaborator for web development, or are interested in innovative technological solutions, I am open to collaboration opportunities! Feel free to fill out the form or send me an email. I look forward to discussing potential collaborations and contributing together to impactful projects.",
    "ct.send": "Send Mesagge"
    
}