{
  "title": "Mihaela Raducu - Frontend Developer | CV",
  "meniu.home": "Acasă",
  "meniu.about": "Despre",
  "meniu.experience": "Experienţă",
  "meniu.portfolio": "Portofoliu",
  "meniu.github": "Github-ul meu",
  "meniu.contact": "Contact",
  "banner.hello": "Salut!",
  "banner.mihaela": "Sunt Mihaela",
  "banner.more": "Despre mine",
  "typed": "Frontend, developer",
  "ab.name": "Nume: ",
  "ab.prof": "Profil: ",
  "ab.phone": "Telefon: ",
  "ab.skill": "Abilități",
  "ab.abt": "Despre mine",
  "ab.para1": "Cu experiență în domeniul tehnologiei, în special în proiecte Smart City, am contribuit la dezvoltarea și implementarea de soluții inovatoare cu impact real.",
  "ab.para2": "În prezent, îmi extind abilitățile în dezvoltare web printr-un curs intensiv de Front-End JavaScript, axat pe HTML, CSS, JavaScript, design responsiv și framework-uri moderne. Obiectivul meu este să îmi construiesc un portofoliu solid și să fac parte dintr-o echipă de dezvoltare colaborativă.",
  "ab.para3": "Aducând o abordare structurată și o atenție deosebită la detalii din rolurile anterioare, combin acestea cu creativitatea și adaptabilitatea dezvoltării web. Pe termen lung, îmi propun să cresc într-un Dezvoltator Full-Stack JavaScript calificat și să contribui la proiecte semnificative și orientate spre viitor.",
  "exp.work": "Experiență profesională",
  "exp.job3": "Manager Proiecte Smart City",
  "exp.data3": "Octombrie 2021 - Noiembrie 2024",
  "exp.work3": "Am gestionat proiecte axate pe integrarea soluțiilor tehnologice inovative în planificarea urbană și strategiile de dezvoltare durabilă. Rolul a implicat supravegherea unor proiecte complexe, colaborarea strânsă cu diverși factori de decizie și livrarea de soluții personalizate pentru Smart City, destinate modernizării și optimizării mediilor urbane.",
  "exp.job2": "Consultant în Dezvoltarea Proiectelor",
  "exp.data2": "Septembrie 2020 - Septembrie 2021",
  "exp.work2": "Am coordonat dezvoltarea și implementarea proiectelor finanțate din fonduri europene, cu un accent deosebit pe dezvoltarea urbană și sustenabilitate. Acest rol a acoperit întregul proces de finanțare, de la identificarea oportunităților și pregătirea aplicațiilor, până la monitorizarea implementării proiectelor, asigurând conformitatea cu standardele europene și adaptarea soluțiilor la nevoile clienților.",
  "exp.job1": "Consilier Finanțări Europene",
  "exp.data1": "Septembrie 2018 - August 2020",
  "exp.work1": "Am dezvoltat și implementat proiecte finanțate din fonduri europene, axate pe dezvoltare durabilă și soluții eficiente pentru dezvoltarea urbană. Acest rol a implicat gestionarea întregului proces, de la planificarea strategică până la execuție, asigurând conformitatea cu standardele europene și îndeplinirea cerințelor specifice ale clienților.",
  "exp.education": "Educație",
  "exp.it": "Cursuri IT",
  "exp.data4": "Noiembrie 2024 - Prezent",
  "exp.frontend": "Dezvoltare Frontend JavaScript",
  "exp.master": "Diplomă de Master",
  "exp.data5": "Octombrie 2016 - Iulie 2018",
  "exp.university": "Universitatea Națională de Studii Politice și Administrative",
  "exp.univ": "Managementul Afacerilor Publice",
  "exp.bachelor": "Diplomă de Licență",
  "exp.data6": "Octombrie 2013 - Iulie 2016",
  "exp.university2": "Universitatea Națională de Studii Politice și Administrative",
  "exp.univ2": "Științe Administrative, Administrație Europeană",
  "exp.certification": "Certificări",
  "exp.management": "Certificat în Managementul Proiectelor",
  "exp.data7": "Iulie 2021 - Septembrie 2021",
  "exp.manager": "Manager de Proiect",
  "exp.smart": "Certificat în Strategii Smart City",
  "exp.data8": "Aprilie 2021 - Iunie 2021",
  "exp.univ3": "Universitatea Națională de Studii Politice și Administrative",
  "exp.public": "Inovație Publică și Strategii Smart City",
  "port.portofolio": "Portofoliu",
  "port.projects": "Cele mai recente proiecte finalizate",
  "proj1.title1": "Parcurs Frontend",
  "proj1.para1": "Acest roadmap oferă o imagine clară a pașilor esențiali pentru a deveni Frontend Developer. Este un ghid structurat pentru cei care doresc să urmeze o carieră în dezvoltare web, dar nu știu de unde să înceapă sau cum să își organizeze procesul de învățare.",
  "port.para2": "Pași esențiali prezentați:",
  "proj1.para3": "Învață fundamentele: HTML, CSS și JavaScript",
  "proj1.para4": "Explorează framework-uri și librării moderne precum React, Vue.js sau Angular",
  "proj1.para5": "Exersează constant prin proiecte personale și provocări de codare",
  "proj1.para6": "Rămâi la curent cu tendințele din industrie și continuă să înveți",
  "proj1.para7": "Construiește un portofoliu care să reflecte abilitățile tale",
  "proj1.para8": "Conectează-te cu comunitatea de dezvoltatori și profesioniști din tech",
  "proj1.para9": "Pentru o prezentare mai detaliată, care include designul complet și resurse utile, accesează postarea de pe LinkedIn: <a href='https://www.linkedin.com/feed/update/urn:li:activity:7303037542184939522/' target='_blank' style='text-decoration: underline; font-weight: bold;'>Vezi postarea pe LinkedIn</a>",
  "proj2.title": "CV-ul Meu",
  "proj2.para1": "CV-ul meu online, realizat ca aplicație de tip single-page, are rolul de a prezenta proiectele, competențele și parcursul meu în dezvoltarea frontend.",
  "proj2.para2": "Dezvoltat folosind HTML, CSS și JavaScript, cu accent pe structură responsive, claritate și accesibilitate pentru utilizator.",
  "proj2.para3": "Proiectul integrează și Bootstrap pentru flexibilitatea layout-ului și Webpack pentru gestionarea resurselor și optimizarea build-ului.",
  "proj3.title": "One-Pager",
  "proj3.para1": "Acesta este un site one-page construit cu HTML, CSS și Bootstrap, conceput pentru a evidenția un layout responsive. Proiectul include un logo personalizat, un banner video pe tot ecranul, elemente animate cu AOS și un mod dark toggle.",
  "proj3.para2": "Funcționalități cheie implementate:",
  "proj3.para3": "Structură responsive cu sistemul de grilă Bootstrap",
  "proj3.para4": "Integrare logo personalizat și favicon",
  "proj3.para5": "Video pe tot ecranul în secțiunea hero",
  "proj3.para6": "Animații la scroll folosind AOS",
  "proj3.para7": "Navigare lină pe secțiuni și header fix",
  "proj3.para8": "Funcționalitate pentru modul dark",
  "proj3.para9": "Formular de contact și hartă Google Maps integrată",
  "proj3.para10": "Structură modulară: Despre, Servicii, Portofoliu, Testimoniale, Contact",
  "proj3.para11": "Structura este completă, iar conținutul vizual (text/imagine) este în curs de rafinare. Este al doilea proiect complet realizat, cu accent pe complexitate, experiența utilizatorului și coerență vizuală.",
  "proj3.para12": "<a href=\"https://mihaelaraducu.github.io/proiectcss/\" target=\"_blank\" style=\"text-decoration: underline; font-weight: bold;\">Vezi proiectul live</a>",
  "proj4.title": "Prezentare de Design",
  "proj4.para1": "Acest mockup creativ a fost conceput pentru a ilustra layout-uri moderne și responsive pe diverse dispozitive. Deși nu este un site funcțional, scoate în evidență principii esențiale de design precum echilibrul, spațiul alb, ierarhia vizuală și tipografia.",
  "proj5.title": "Parcurs Frontend",
  "proj5.para1": "Această compoziție vizuală reprezintă un moment important din etapa mea de început ca dezvoltator frontend. După ce am realizat primul meu site responsive folosind HTML și CSS, am început să mă concentrez mai mult pe structura layout-ului, sistemele de design și comportamentul responsive pe diferite dispozitive.",
  "proj5.para2": "Deși nu este un proiect funcțional, acest mockup surprinde tranziția de la o implementare strict tehnică la un design vizual mai intenționat și bine gândit. Reflectă o etapă importantă în care am început să corelez execuția tehnică cu experiența utilizatorului și claritatea designului.",
  "proj5.para3": "Această etapă a marcat începutul unei abordări mai strategice în modul în care planific, structurez și prezint munca mea.",
  "proj6.title": "Website Responsive",
  "proj6.para1": "Acest proiect reprezintă primul meu pas în dezvoltarea frontend, concentrându-mă pe construirea unui website static complet responsive folosind doar HTML și CSS. Mi-a oferit ocazia să aplic principii de bază privind layout-ul, structura și designul responsive.",
  "proj6.para2": "Zone de interes cheie:",
  "proj6.para3": "Structură semantică HTML pentru claritate și accesibilitate",
  "proj6.para4": "Stilizare CSS cu accent pe ierarhie vizuală și structură",
  "proj6.para5": "Design responsive folosind media queries și unități flexibile",
  "proj6.para6": "Layout optimizat pentru diferite dimensiuni de dispozitive",
  "proj6.para7": "Acest proiect a marcat începutul parcursului meu în dezvoltarea frontend. M-a ajutat să înțeleg cum se îmbină structura și stilul pentru a crea experiențe accesibile și prietenoase pe toate dispozitivele.",
  "proj6.para8": "<a href=\"https://mihaelaraducu.github.io/html-css-project/\" target=\"_blank\" style=\"text-decoration: underline; font-weight: bold;\">Vezi proiectul live</a>",
  "git.noscript": "JavaScript-ul este dezactivat în browserul tău. Te rog să-l activezi pentru a vizualiza conținutul corect.",
  "git.repo": "Repo-ul meu GitHub",
  "git.hub": "Cel mai recent repo GitHub",
  "ct.message": "Trimite-mi un mesaj",
  "ct.place.name": "Nume",
  "ct.place.email": "Emailul tău",
  "ct.place.subject": "Subiect",
  "ct.place.message": "Mesaj",
  "ct.title": "Dorești să colaborăm?",
  "ct.inf": "Fie că ai nevoie de ajutor pentru un proiect frontend, construiești o echipă de dezvoltare web sau vrei să implementezi soluții tehnologice moderne, sunt deschisă către colaborări!<br>Completează formularul sau trimite-mi un email.<br>Aștept cu drag să discutăm despre proiecte cu impact.",
  "ct.send": "Trimite Mesaj",
  "ct.valid1.name": "Câmpul Nume este valid!",
  "ct.invalid1.name": "Câmpul Nume trebuie completat corect!",
  "ct.valid2.email": "Câmpul Email este valid!",
  "ct.invalid2.email": "Câmpul Email trebuie completat corect!",
  "ct.valid3.subject": "Câmpul Subiect este valid!",
  "ct.invalid3.subject": "Câmpul Subiect trebuie completat corect!",
  "ct.valid4.message": "Câmpul Mesaj este valid!",
  "ct.invalid4.message": "Câmpul Mesaj trebuie completat corect!",
  "ft.copy": "<span>&copy;</span> Drepturi de autor <strong>Mihaela Raducu</strong>. Toate drepturile rezervate",
  "ft.credits": "Proiect realizat de <a href=\"#\">Mihaela Raducu</a>"
}